# Density Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..Density Property
StructuralAsset Class See Also
---
The density of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Density { get; set; }
```

Visual Basic
---
```text
Public Property Density As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Density {
	double get ();
	void set (double value);
}
```

# Remarks
Values are in kilograms per cubed feet (kg/ft³) and must be non-negative.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for density must be non-negative. |

# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace